[
  {
    "id": "2025-09-20",
    "dateLabel": "Sep 20, 2025",
    "weekday": "Saturday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump Administration to Stop Measuring Food Insecurity",
    "snippet": "The move strips the government of its main gauge of hunger in America, and will impede efforts to track the impact of aid cuts.",
    "lead": "The move strips the government of its main gauge of hunger in America, and will impede efforts to track the impact of aid cuts.",
    "events": [
      {
        "title": "Trump Administration to Stop Measuring Food Insecurity",
        "summary": "The move strips the government of its main gauge of hunger in America, and will impede efforts to track the impact of aid cuts.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/09/20/us/politics/trump-hunger-report-data.html"
      },
      {
        "title": "Pentagon places further restrictions on journalists' access",
        "summary": "Journalists who cover the Defense Department at the Pentagon can no longer gather or report information, even if it is unclassified, unless it’s been authorized for release by the government, defense…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/news/us-news/pentagon-places-restrictions-journalist-access-rcna232662"
      },
      {
        "title": "Trump publicly pushes Attorney General Pam Bondi to prosecute his political foes",
        "summary": "President Donald Trump exerted public pressure Saturday night on Attorney General Pam Bondi, saying it was time for the Justice Department to take action against a number of his political foes",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/trump-administration/trump-publicly-pushes-attorney-general-pam-bondi-go-political-foes-rcna232669"
      }
    ]
  },
  {
    "id": "2025-09-21",
    "dateLabel": "Sep 21, 2025",
    "weekday": "Sunday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump looms over New Jersey's race for governor as candidates clash in their first debate",
    "snippet": "Voters in New Jersey may not be see the president on the ballot when they select their next governor in November, but President Donald Trump still looms over t…",
    "lead": "Voters in New Jersey may not be see the president on the ballot when they select their next governor in November, but President Donald Trump still looms over the race, with the candidates clashing over his administration’s policies in their first debate.",
    "events": [
      {
        "title": "Trump looms over New Jersey's race for governor as candidates clash in their first debate",
        "summary": "Voters in New Jersey may not be see the president on the ballot when they select their next governor in November, but President Donald Trump still looms over the race, with the candidates clashing ov…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/elections/trump-looms-new-jerseys-race-governor-candidates-clash-first-debate-rcna231893"
      },
      {
        "title": "12 Emotional Hours: A Spectator Reflects on One Full Day (Without Caffeine)",
        "summary": "Attending Charlie Kirk’s memorial involved lots of standing, worrying and waiting. But for one Colorado Springs woman, it was all worth it.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/09/21/us/politics/spectator-long-day.html"
      },
      {
        "title": "The H-1B Visa: Why Is Trump Adding a $100,000 Fee?",
        "summary": "President Trump signed a proclamation on Friday adding a $100,000 fee to visas for skilled foreign workers. Immigration hard-liners have criticized the program for replacing American workers.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/09/20/us/politics/h1b-visa-trump-immigration.html"
      }
    ]
  },
  {
    "id": "2025-09-22",
    "dateLabel": "Sep 22, 2025",
    "weekday": "Monday",
    "descriptor": "Top Stories",
    "topHeadline": "Pennsylvania man charged with forcing immigrant teens to work on farm",
    "snippet": "Pennsylvania authorities have charged a man with allegedly bringing two teenaged girls into the U.S. from Mexico and Guatemala and then forcing them to work on…",
    "lead": "Pennsylvania authorities have charged a man with allegedly bringing two teenaged girls into the U.S. from Mexico and Guatemala and then forcing them to work on a farm for little or no pay, the state attorney general said Monday",
    "events": [
      {
        "title": "Pennsylvania man charged with forcing immigrant teens to work on farm",
        "summary": "Pennsylvania authorities have charged a man with allegedly bringing two teenaged girls into the U.S. from Mexico and Guatemala and then forcing them to work on a farm for little or no pay, the state…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/immigration/pennsylvania-man-charged-forcing-immigrant-teens-work-farm-rcna233107"
      },
      {
        "title": "For Trump, Who Has ‘Strong Feelings’ About Autism, the Issue Is Personal",
        "summary": "The president delivered impassioned — if scientifically dubious — remarks about what he described as one of “the most alarming public health developments in history.”",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/09/22/us/politics/autism-vaccines-trump-personal.html"
      },
      {
        "title": "Mamdani Lands Endorsement From Kamala Harris, His Biggest Yet",
        "summary": "“I support the Democrat in the race,” Ms. Harris said during an interview with Rachel Maddow. She added of the Democratic Party, “we’ve got a big tent and we’ve got a lot of stars.”",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/09/22/us/politics/kamala-harris-endorsement-zohran-mamdani.html"
      }
    ]
  },
  {
    "id": "2025-09-23",
    "dateLabel": "Sep 23, 2025",
    "weekday": "Tuesday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump Cancels Meeting with Democrats, Bringing Shutdown Closer",
    "snippet": "President Trump canceled a planned meeting with congressional Democrats ahead of the looming government funding deadline, escalating the risk of a shutdown.",
    "lead": "President Trump canceled a planned meeting with congressional Democrats ahead of the looming government funding deadline, escalating the risk of a shutdown.",
    "events": [
      {
        "title": "Trump Cancels Meeting with Democrats, Bringing Shutdown Closer",
        "summary": "Trump cited “unserious and ridiculous” demands by Democrats, calling off a crucial meeting meant to negotiate spending before the fiscal year ends September 30.",
        "source": "Washington Post",
        "url": "https://www.washingtonpost.com/business/2025/09/23/trump-cancels-democrat-meeting-shutdown/"
      },
      {
        "title": "Trump Scraps Meeting with Democrats, Raising Government Shutdown Risk",
        "summary": "By canceling talks with top Democrats, Trump intensifies the standoff over funding and raises stakes for a partial government shutdown.",
        "source": "Reuters",
        "url": "https://www.reuters.com/world/us/trump-scraps-meeting-with-democrats-funding-us-shutdown-looms-2025-09-23/"
      },
      {
        "title": "At UN, President Trump Champions Sovereignty, Rejects Globalism",
        "summary": "In his address to the 80th session of the UN General Assembly, Trump pushed back against globalism and framed a vision of sovereign nations resisting interference.",
        "source": "White House (official)",
        "url": "https://www.whitehouse.gov/articles/2025/09/at-un-president-trump-champions-sovereignty-rejects-globalism/"
      },
      {
        "title": "Trump Claims Acetaminophen Use Linked to Autism, Draws Backlash",
        "summary": "Trump advised pregnant women to limit use of acetaminophen, claiming it raises autism risk—remarks swiftly denounced by medical experts as unscientific.",
        "source": "The Guardian",
        "url": "https://www.theguardian.com/us-news/2025/sep/23/trump-administration-news-tylenol-paracetamol-updates-today"
      }
    ]
  },
  {
    "id": "2025-09-24",
    "dateLabel": "Sep 24, 2025",
    "weekday": "Wednesday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump Administration Eyes More Mass Layoffs if Government Shuts Down",
    "snippet": "The president’s top aides told agencies to prepare for potential firings if Congress cannot extend funding before the end of Sept. 30.",
    "lead": "The president’s top aides told agencies to prepare for potential firings if Congress cannot extend funding before the end of Sept. 30.",
    "events": [
      {
        "title": "Trump Administration Eyes More Mass Layoffs if Government Shuts Down",
        "summary": "The president’s top aides told agencies to prepare for potential firings if Congress cannot extend funding before the end of Sept. 30.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/09/24/us/politics/trump-shutdown-layoffs.html"
      },
      {
        "title": "White House lays groundwork for mass government firings if there's a shutdown",
        "summary": "The Office of Management and Budget says in a memo that agencies should prepare reduction-in-force plans to accompany furloughs if a spending bill isn't passed next week.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/white-house/white-house-omb-memo-mass-firings-government-shutdown-congress-rcna233590"
      },
      {
        "title": "A Federal Shutdown May Be Imminent. How Would It Affect the Economy?",
        "summary": "Congress and the White House have days to fund the government and avert a disruptive and potentially costly lapse in funding.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/09/24/us/politics/government-shutdown-us-economy.html"
      }
    ]
  },
  {
    "id": "2025-09-25",
    "dateLabel": "Sep 25, 2025",
    "weekday": "Thursday",
    "descriptor": "Top Stories",
    "topHeadline": "What's next for James Comey after his indictment?",
    "snippet": "Former FBI Director James Comey will need to hire a defense attorney who will receive all the discovery materials from the grand jury case. NBC News' Laura Jar…",
    "lead": "Former FBI Director James Comey will need to hire a defense attorney who will receive all the discovery materials from the grand jury case. NBC News' Laura Jarrett reports that Comey will likely file a motion to dismiss.",
    "events": [
      {
        "title": "What's next for James Comey after his indictment?",
        "summary": "Former FBI Director James Comey will need to hire a defense attorney who will receive all the discovery materials from the grand jury case. NBC News' Laura Jarrett reports that Comey will likely file…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/video/what-s-next-for-james-comey-after-his-indictment-248371269855"
      },
      {
        "title": "Right-wing terror attacks plunged in 2025, while left-wing attacks ticked up: study",
        "summary": "From 2011 through 2024, an average of 20 right-wing terror incidents took place each year, compared to an average of nearly three left-wing incidents annually.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/politics-news/right-wing-terror-attacks-plunged-2025-left-wing-attacks-ticked-study-rcna233704"
      },
      {
        "title": "Trump’s pick of former attorney in Virginia fuels concerns over political influence",
        "summary": "President Trump appointed former personal attorney Lindsey Halligan as U.S. attorney in Virginia after a veteran prosecutor resigned over resisting charges against James Comey. The move has raised co…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/video/trump-s-pick-of-former-attorney-in-virginia-fuels-concerns-over-political-influence-248370245987"
      }
    ]
  },
  {
    "id": "2025-09-26",
    "dateLabel": "Sep 26, 2025",
    "weekday": "Friday",
    "descriptor": "Top Stories",
    "topHeadline": "James Comey indicted amid sweeping political maneuvers",
    "snippet": "Ex-FBI Director James Comey was indicted on charges of making false statements to Congress and obstruction of justice, launching a dramatic escalation in the Trump-era legal and political wars.",
    "lead": "Former FBI Director James Comey was indicted by a federal grand jury on charges of making false statements to Congress and obstruction of justice. The move drew sharp criticism from Democrats, warnings about politicization of justice, and support from Trump allies who framed it as accountability.",
    "events": [
      {
        "title": "Comey indicted on false statement and obstruction charges",
        "summary": "A federal grand jury formally charged James Comey with one count of making a false statement to Congress and one count of obstruction of justice. Media reports indicate that the indictment is tied to his 2020 testimony on Trump’s actions during the Russia probe and internal DOJ disputes.",
        "source": "Reuters",
        "url": "https://www.reuters.com/world/us/come-indicted-escalates-trump-campaign-hurt-justice-dept-analysts-2025-09-26/"
      },
      {
        "title": "Trump unveils aggressive new tariffs on drugs, trucks, furniture",
        "summary": "President Trump announced sweeping new tariffs: a 100 % tariff on imported pharmaceuticals, 25 % on heavy-duty trucks, and 50 % on kitchen cabinets and furniture. Critics say the move could dramatically raise consumer prices and worsen trade relations.",
        "source": "Reuters",
        "url": "https://www.reuters.com/world/us/trump-slaps-steep-us-tariffs-drugs-heavy-trucks-furniture-2025-09-26/"
      },
      {
        "title": "Assata Shakur, fugitive Black activist, dies in Cuba at 78",
        "summary": "Assata Shakur—convicted in 1977 for killing a New Jersey state trooper and long since exiled in Cuba—died at age 78. Cuban authorities cited health issues and advanced age. Her death reignited debates over race, justice, and U.S.–Cuba relations.",
        "source": "Reuters",
        "url": "https://www.reuters.com/world/us/assata-shakur-fugitive-prominent-black-activist-dies-cuba-78-2025-09-26/"
      }
    ]
  },
  {
    "id": "2025-09-27",
    "dateLabel": "Sep 27, 2025",
    "weekday": "Saturday",
    "descriptor": "Top Stories",
    "topHeadline": "Inside the Trump Administration’s Push to Prosecute James Comey",
    "snippet": "President Trump’s campaign of retribution began to intensify in mid-July and hit a fever pitch over the last week, culminating in the indictment of one of his…",
    "lead": "President Trump’s campaign of retribution began to intensify in mid-July and hit a fever pitch over the last week, culminating in the indictment of one of his foremost enemies.",
    "events": [
      {
        "title": "Inside the Trump Administration’s Push to Prosecute James Comey",
        "summary": "President Trump’s campaign of retribution began to intensify in mid-July and hit a fever pitch over the last week, culminating in the indictment of one of his foremost enemies.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/09/27/us/politics/trump-comey-justice-department.html"
      },
      {
        "title": "Trump to meet with top congressional leaders as a government shutdown looms",
        "summary": "President Donald Trump will meet with the top four congressional leaders at the White House on Monday as the clock draws nearer to a potential government shutdown.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/politics-news/trump-top-congressional-leaders-government-shutdown-looms-rcna234137"
      },
      {
        "title": "Giuliani and Dominion Voting Systems Settle $1.3 Billion Defamation Suit",
        "summary": "The election technology company Dominion Voting Systems had accused Rudolph W. Giuliani of waging “a viral disinformation campaign” over the 2020 election.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/09/27/us/politics/rudy-giuliani-dominion-case-settlement.html"
      }
    ]
  },
  {
    "id": "2025-09-28",
    "dateLabel": "Sep 28, 2025",
    "weekday": "Sunday",
    "descriptor": "Top Stories",
    "topHeadline": "Republicans press Democrats to accept short-term bill as shutdown looms",
    "snippet": "GOP leaders urged Senate Democrats to accept a brief stopgap to keep the government open while longer talks continue, as the White House floated aggressive belt-tightening options if funding lapses.",
    "lead": "With a shutdown days away, congressional Republicans pushed for a short-term funding bill and blamed Democrats for the impasse, while reporting indicated the administration was exploring ‘backdoor’ cuts that could bite even without new legislation.",
    "events": [
      {
        "title": "Republicans urge Democrats to agree to short-term bill to keep government open",
        "summary": "GOP leaders said a temporary measure was needed before the Tuesday night deadline and warned thousands of federal workers could be furloughed if talks fail.",
        "source": "Reuters",
        "url": "https://www.reuters.com/world/us/republicans-urge-democrats-agree-short-term-bill-keep-us-government-open-2025-09-28/"
      },
      {
        "title": "Report: 'Backdoor' funding cuts possible as shutdown fight intensifies",
        "summary": "The administration examined ways to reduce spending administratively if Congress does not act, escalating the standoff over budget priorities.",
        "source": "Reuters",
        "url": "https://www.reuters.com/world/us/backdoor-funding-cuts-possible-by-trump-administration-congress-faces-government-2025-09-28/"
      },
      {
        "title": "Trump says he’ll tell U.S. military leaders 'we love them' ahead of meeting",
        "summary": "The president previewed remarks to top military brass as Washington braced for a possible funding lapse midweek.",
        "source": "Reuters",
        "url": "https://www.reuters.com/world/us/trump-attend-meeting-with-top-military-leaders-washington-post-reports-2025-09-28/"
      }
    ]
  },
  {
    "id": "2025-09-29",
    "dateLabel": "Sep 29, 2025",
    "weekday": "Monday",
    "descriptor": "Top Stories",
    "topHeadline": "Vance says U.S. ‘headed to a shutdown’ as Senate eyes Tuesday vote",
    "snippet": "After White House talks, Vice President J.D. Vance said a shutdown looked likely, while Senate leaders teed up a vote for Tuesday with key policy disputes unresolved.",
    "lead": "Negotiations produced no breakthrough as the administration released sharper shutdown contingencies and Senate leaders planned a last-ditch vote for the final day before funding expires.",
    "events": [
      {
        "title": "Vance warns U.S. is ‘headed to a shutdown’ after meeting with Democrats",
        "summary": "The vice president’s remarks underscored the widening gap over healthcare and other riders in the funding fight.",
        "source": "Reuters",
        "url": "https://www.reuters.com/world/us/us-democrats-trump-set-face-off-budget-battle-that-could-trigger-govt-shutdowns-2025-09-29/"
      },
      {
        "title": "Top Senate Republican says chamber will vote Tuesday to avert shutdown",
        "summary": "Leaders set up a procedural vote, but the measure faced an uphill path given Democratic opposition to GOP-only terms.",
        "source": "Reuters",
        "url": "https://www.reuters.com/world/us/top-us-senate-republican-says-lawmakers-will-vote-tuesday-bill-avert-government-2025-09-29/"
      },
      {
        "title": "Agencies detail shutdown plans; mass-firing threat looms in guidance",
        "summary": "Departments outlined furloughs and paused services, with new guidance signaling the administration could use a lapse to shrink the federal workforce.",
        "source": "Reuters",
        "url": "https://www.reuters.com/business/world-at-work/trump-administrations-shutdown-plans-trickle-deadline-nears-2025-09-29/"
      }
    ]
  },
  {
    "id": "2025-09-30",
    "dateLabel": "Sep 30, 2025",
    "weekday": "Tuesday",
    "descriptor": "Top Stories",
    "topHeadline": "Explaining Democrats’ Misleading Talking Point on the Government Shutdown",
    "snippet": "Democrats have misused budget jargon to assail the Republican budget proposal as “dirty,” but the bill is considered “clean.”",
    "lead": "Democrats have misused budget jargon to assail the Republican budget proposal as “dirty,” but the bill is considered “clean.”",
    "events": [
      {
        "title": "Explaining Democrats’ Misleading Talking Point on the Government Shutdown",
        "summary": "Democrats have misused budget jargon to assail the Republican budget proposal as “dirty,” but the bill is considered “clean.”",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/09/30/us/politics/democrats-government-shutdown-healthcare.html"
      },
      {
        "title": "Schumer and Thune Spar as Government Shutdown Nears",
        "summary": "Senators fought over a chart. The speaker displayed a big-screen TV. And hundreds of House Democrats took to the floor as the two parties blamed each other for the crisis.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/09/30/us/politics/democrats-shutdown-house.html"
      },
      {
        "title": "In Some States, Strapped Counties Must Impose Trump’s Medicaid Cuts",
        "summary": "The president’s domestic policy law created complex new work requirements for Medicaid and food stamps, but left the states to administer them. Colorado pushes that burden to its counties.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/09/30/us/politics/counties-medicaid-cuts.html"
      }
    ]
  },
  {
    "id": "2025-10-01",
    "dateLabel": "Oct 1, 2025",
    "weekday": "Wednesday",
    "descriptor": "Top Stories",
    "topHeadline": "For Workers, Mixed Signals. For the Public, Limited Impact on Shutdown’s First Day.",
    "snippet": "Federal agencies gave shifting and mixed guidance to their work forces about who should come to work and who shouldn’t, but the initial effect on services appe…",
    "lead": "Federal agencies gave shifting and mixed guidance to their work forces about who should come to work and who shouldn’t, but the initial effect on services appeared scattered and limited.",
    "events": [
      {
        "title": "For Workers, Mixed Signals. For the Public, Limited Impact on Shutdown’s First Day.",
        "summary": "Federal agencies gave shifting and mixed guidance to their work forces about who should come to work and who shouldn’t, but the initial effect on services appeared scattered and limited.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/01/us/politics/shutdown-federal-workers-agencies.html"
      },
      {
        "title": "Activists say Israeli navy intercepted nine boats from aid flotilla headed to Gaza",
        "summary": "The Israeli navy on Wednesday intercepted an aid flotilla bound for Gaza that was being closely watched around the world through their social media posts, according to activists within the flotilla.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/world/gaza/activists-say-israeli-navy-intercepted-nine-boats-aid-flotilla-headed-rcna235080"
      },
      {
        "title": "The Be-Careful-What-You-Wish-For Shutdown",
        "summary": "Unlike in shutdowns past, President Trump is the wild card.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/01/us/politics/politics-shutdown-democrats-trump.html"
      }
    ]
  },
  {
    "id": "2025-10-02",
    "dateLabel": "Oct 2, 2025",
    "weekday": "Thursday",
    "descriptor": "Top Stories",
    "topHeadline": "Ann Fagan Ginger, Tireless Defender of Civil Liberties, Dies at 100",
    "snippet": "She was among the last of a generation of activists and lawyers who weathered the Red Scare, and then helped train a new cohort in the decades that followed.",
    "lead": "She was among the last of a generation of activists and lawyers who weathered the Red Scare, and then helped train a new cohort in the decades that followed.",
    "events": [
      {
        "title": "Ann Fagan Ginger, Tireless Defender of Civil Liberties, Dies at 100",
        "summary": "She was among the last of a generation of activists and lawyers who weathered the Red Scare, and then helped train a new cohort in the decades that followed.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/02/us/ann-fagan-ginger-dead.html"
      },
      {
        "title": "Trump Escalates Attacks on Democrats in a Government Shutdown Like No Other",
        "summary": "Shutdowns are always unpleasant affairs. But President Trump has used his power in aggressive and strikingly personal ways.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/02/us/politics/shutdown-trump-clinton-gingrich.html"
      },
      {
        "title": "Statue of Trump and Epstein holding hands returns to the National Mall",
        "summary": "A statue featuring President Donald Trump alongside convicted sex offender Jeffrey Epstein has reappeared in front of the Capitol after being removed last week.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/donald-trump/donald-trump-jeffrey-epstein-statue-returns-national-mall-capitol-rcna235314"
      }
    ]
  },
  {
    "id": "2025-10-03",
    "dateLabel": "Oct 3, 2025",
    "weekday": "Friday",
    "descriptor": "Top Stories",
    "topHeadline": "Senate Fails to Advance Funding Bill as Shutdown Enters Third Day",
    "snippet": "The Senate failed yet again to advance a stopgap funding measure, deepening the federal shutdown and escalating partisan tensions.",
    "lead": "On day three of the government shutdown, Senate Republicans were unable to reach the 60-vote threshold to move forward their appropriations bill, while Democrats held their ground on demands tied to healthcare subsidies.",
    "events": [
      {
        "title": "Senate Vote Fails Again on Stopgap Funding, Shutdown Persists",
        "summary": "On Oct. 3, the Senate failed to advance a Republican-backed continuing resolution, prolonging the federal government shutdown. Democrats rejected moving forward without inclusion of healthcare subsidies.",
        "source": "Associated Press / CBS News",
        "url": "https://apnews.com/article/138e0bd690d616f0735429890d28196f"
      },
      {
        "title": "Trump Readies Layoffs as Hopes for Swift Resolution Fade",
        "summary": "With no breakthrough in sight, the White House signaled it may begin mass layoffs of federal workers unless the shutdown is resolved soon.",
        "source": "Associated Press / ClickOrlando",
        "url": "https://www.clickorlando.com/business/2025/10/03/hopes-fade-for-quick-end-to-shutdown-as-trump-readies-layoffs-and-cuts/"
      },
      {
        "title": "Judiciary Warns It May Not Sustain Operations Past Oct. 3",
        "summary": "The U.S. judiciary’s internal memo indicated that without new appropriations, many federal courts may have to curtail staff operations after Oct. 3, threatening legal backlogs.",
        "source": "Reuters / Courts’ internal memo",
        "url": "https://www.reuters.com/legal/government/us-judiciary-may-not-fully-sustain-operations-past-october-3-government-shutdown-2025-09-24/"
      },
      {
        "title": "Trump Nominated for Nobel Peace Prize Again, Experts Skeptical",
        "summary": "President Trump received another Nobel Peace Prize nomination, though analysts broadly view it as symbolic and unlikely to succeed this year.",
        "source": "Associated Press / ABC News",
        "url": "https://abcnews.go.com/International/wireStory/trump-nominated-nobel-peace-prize-experts-win-year-126176542"
      },
      {
        "title": "Hegseth Announces Strike Killing Four on Venezuelan Vessel",
        "summary": "Defense Secretary Pete Hegseth announced that a U.S. strike on a vessel off the Venezuelan coast killed four, claiming it was trafficking narcotics toward the U.S.",
        "source": "Public reporting / Wikipedia summary",
        "url": "https://en.wikipedia.org/wiki/2025_United_States_strikes_on_Venezuelan_boats"
      },
      {
        "title": "Hamas Accepts Hostage Release Terms, Trump Issues Deadline",
        "summary": "On Oct. 3, Hamas declared willingness to hand over governance of Gaza to technocrats and release hostages, while rejecting full disarmament. Trump set a deadline of Oct. 5 for acceptance.",
        "source": "Wikipedia summary / multiple news reports",
        "url": "https://en.wikipedia.org/wiki/Gaza_International_Transitional_Authority"
      }
    ]
  },
  {
    "id": "2025-10-04",
    "dateLabel": "Oct 4, 2025",
    "weekday": "Saturday",
    "descriptor": "Top Stories",
    "topHeadline": "Judge Blocks Trump’s Deployment of National Guard in Portland, Ore.",
    "snippet": "A federal judge appointed by President Trump issued a temporary restraining order, siding for now with Oregon and Portland lawyers who called federalizing the…",
    "lead": "A federal judge appointed by President Trump issued a temporary restraining order, siding for now with Oregon and Portland lawyers who called federalizing the guard a presidential overreach.",
    "events": [
      {
        "title": "Judge Blocks Trump’s Deployment of National Guard in Portland, Ore.",
        "summary": "A federal judge appointed by President Trump issued a temporary restraining order, siding for now with Oregon and Portland lawyers who called federalizing the guard a presidential overreach.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/04/us/politics/judge-blocks-national-guard-portland.html"
      },
      {
        "title": "For Netanyahu, Trump’s Nod to Peace Puts Him in a Tough Spot",
        "summary": "The Israeli leader thought he had a plan from the U.S. president that would have represented total victory over Hamas. Suddenly, it looks as though he might not get everything he wants.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/04/world/middleeast/netanyahu-israel-trump-gaza-plan.html"
      },
      {
        "title": "Judge temporarily blocks use of National Guard in Portland",
        "summary": "A federal judge in Oregon on Saturday temporarily blocked the deployment of 200 National Guard troops to Portland.U.S.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/trump-administration/judge-temporarily-blocks-use-national-guard-portland-rcna235664"
      }
    ]
  },
  {
    "id": "2025-10-05",
    "dateLabel": "Oct 5, 2025",
    "weekday": "Sunday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump Calls Deadly Strikes on Boats in Caribbean an ‘Act of Kindness’",
    "snippet": "The president, speaking aboard an aircraft carrier off Norfolk, Va., repeated his claims that the boats were trafficking drugs bound for the United States.",
    "lead": "The president, speaking aboard an aircraft carrier off Norfolk, Va., repeated his claims that the boats were trafficking drugs bound for the United States.",
    "events": [
      {
        "title": "Trump Calls Deadly Strikes on Boats in Caribbean an ‘Act of Kindness’",
        "summary": "The president, speaking aboard an aircraft carrier off Norfolk, Va., repeated his claims that the boats were trafficking drugs bound for the United States.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/05/us/politics/trump-caribbean-strikes-drugs-kindness.html"
      },
      {
        "title": "California sues Trump admin. over National Guard deployment",
        "summary": "California Governor Gavin Newsom said on Sunday that the state is suing President Trump over the deployment of hundreds of California National Guard troops to Oregon. It comes as the president vows t…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/video/-california-sues-trump-admin-over-national-guard-deployment-249142341809"
      },
      {
        "title": "2 Motorists Charged in Chicago, Including One Shot by Federal Agent",
        "summary": "The account in the federal criminal complaint, which differs significantly from an earlier homeland security statement, says the motorists rammed officers’ vehicle and that an agent shot one when she…",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/05/us/politics/chicago-motorists-charged-border-patrol.html"
      }
    ]
  },
  {
    "id": "2025-10-06",
    "dateLabel": "Oct 6, 2025",
    "weekday": "Monday",
    "descriptor": "Top Stories",
    "topHeadline": "Flight Delays Begin as Air Traffic Staffing Shortages Worsen",
    "snippet": "The delays came just hours after the transportation secretary warned that flying could be disrupted by the government shutdown.",
    "lead": "The delays came just hours after the transportation secretary warned that flying could be disrupted by the government shutdown.",
    "events": [
      {
        "title": "Flight Delays Begin as Air Traffic Staffing Shortages Worsen",
        "summary": "The delays came just hours after the transportation secretary warned that flying could be disrupted by the government shutdown.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/06/us/politics/flight-delays-faa-shutdown.html"
      },
      {
        "title": "FAA reports staffing issues at airports as government shutdown continues",
        "summary": "The Federal Aviation Administration was experiencing staffing issues or anticipating shortages at airports and other air traffic control facilities in the United States on Monday night.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/news/us-news/faa-reports-staffing-issues-airports-government-shutdown-continues-rcna236049"
      },
      {
        "title": "DOJ: Alleged gang member arrested in murder-for-hire plot against Chicago immigration officer",
        "summary": "The Justice Department announced it arrested an alleged gang member in a plot to kill an immigration officer in Chicago. It comes as there’s a legal showdown over President Trump’s potential deployme…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/nightly-news/video/doj-alleged-gang-member-arrested-in-murder-for-hire-plot-against-chicago-immigration-officer-249228357912"
      }
    ]
  },
  {
    "id": "2025-10-07",
    "dateLabel": "Oct 7, 2025",
    "weekday": "Tuesday",
    "descriptor": "Top Stories",
    "topHeadline": "Senate confirms scientist with ties to 'Sharpiegate' as top NOAA official",
    "snippet": "Neil Jacobs was assistant secretary for environmental observation when Trump displayed a map altered with a black Sharpie to incorrectly show Hurricane Dorian'…",
    "lead": "Neil Jacobs was assistant secretary for environmental observation when Trump displayed a map altered with a black Sharpie to incorrectly show Hurricane Dorian's path.",
    "events": [
      {
        "title": "Senate confirms scientist with ties to 'Sharpiegate' as top NOAA official",
        "summary": "Neil Jacobs was assistant secretary for environmental observation when Trump displayed a map altered with a black Sharpie to incorrectly show Hurricane Dorian's path.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/congress/senate-confirms-neil-jacobs-trump-sharpiegate-noaa-administrator-rcna236289"
      },
      {
        "title": "Trump Appoints New Head of Immigration Courts",
        "summary": "Col. Daren K. Margolin, who retired from the Marine Corps, was fired from a command position as head of security at Marine Base Quantico in 2013 for negligently firing a gun into the floor of his off…",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/07/us/politics/trump-immigration-courts.html"
      },
      {
        "title": "Supreme Court appears skeptical of LGBTQ conversion therapy bans",
        "summary": "The Supreme Court appeared to be leaning towards ruling against a conversion therapy ban in Colorado during oral arguments in a case brought by a Christian therapist who argued the ban violates her r…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/video/supreme-court-appears-skeptical-of-lgbtq-conversion-therapy-bans-249324101730"
      }
    ]
  },
  {
    "id": "2025-10-08",
    "dateLabel": "Oct 8, 2025",
    "weekday": "Wednesday",
    "descriptor": "Top Stories",
    "topHeadline": "'Shame on you': Mikie Sherrill, Jack Ciattarelli spar in final debate of N.J. governor's race",
    "snippet": "Democratic Rep. Mikie Sherrill and Republican Jack Ciattrelli clashed during their final debate of the New Jersey governor’s race Wednesday night, with each ch…",
    "lead": "Democratic Rep. Mikie Sherrill and Republican Jack Ciattrelli clashed during their final debate of the New Jersey governor’s race Wednesday night, with each chiding the other, “Shame on you” in heated exchanges",
    "events": [
      {
        "title": "'Shame on you': Mikie Sherrill, Jack Ciattarelli spar in final debate of N.J. governor's race",
        "summary": "Democratic Rep. Mikie Sherrill and Republican Jack Ciattrelli clashed during their final debate of the New Jersey governor’s race Wednesday night, with each chiding the other, “Shame on you” in heate…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/elections/shame-mikie-sherrill-jack-ciattarelli-spar-final-debate-new-jersey-gov-rcna235441"
      },
      {
        "title": "Lawler Confronts Jeffries in Showy Exchange in a Tense Capitol",
        "summary": "The roughly five-minute confrontation, initiated by Representative Mike Lawler of New York, was intended to draw attention to Democrats’ role in the government shutdown.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/08/nyregion/lawler-jeffries-confrontation.html"
      },
      {
        "title": "Trump may travel to Middle East after Israel and Hamas agree to first phase of peace plan",
        "summary": "President Trump announced that Israel and Hamas have agreed to the first phase of his peace plan. Trump said he could travel to the mideast this weekend. NBC News’ Gabe Gutierrez has more.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/nightly-news/video/trump-israel-and-hamas-agree-to-first-phase-of-his-peace-plan-249423429945"
      }
    ]
  },
  {
    "id": "2025-10-09",
    "dateLabel": "Oct 9, 2025",
    "weekday": "Thursday",
    "descriptor": "Top Stories",
    "topHeadline": "Virginia gubernatorial candidates clash over Jay Jones' violent texts in lone debate",
    "snippet": "Democrat Abigail Spanberger and Republican Winsome Earle-Sears sparred frequently and bitterly Thursday during their only debate of this fall's Virginia govern…",
    "lead": "Democrat Abigail Spanberger and Republican Winsome Earle-Sears sparred frequently and bitterly Thursday during their only debate of this fall's Virginia governor’s race — and much of it wasn’t even about the two candidates onstage",
    "events": [
      {
        "title": "Virginia gubernatorial candidates clash over Jay Jones' violent texts in lone debate",
        "summary": "Democrat Abigail Spanberger and Republican Winsome Earle-Sears sparred frequently and bitterly Thursday during their only debate of this fall's Virginia governor’s race — and much of it wasn’t even a…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/elections/abigail-spanberger-winsome-earle-sears-virgina-governor-debate-rcna235418"
      },
      {
        "title": "Democratic Alarm Over an Unbound Trump Fuels Shutdown Standoff",
        "summary": "The threat of rising Obamacare premiums has been Democrats’ main focus in the public debate, but the president’s defiance of laws, norms and congressional constraints has helped hold them together in…",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/09/us/politics/democrats-shutdown-trump-administration.html"
      },
      {
        "title": "How the Israel-Hamas ceasefire deal came together",
        "summary": "President Donald Trump had to maintain the trust of Israel and a series of Arab- and Muslim-majority nations. His ability to walk that tightrope was tested repeatedly.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/donald-trump/israel-hamas-ceasefire-deal-came-together-rcna236789"
      }
    ]
  },
  {
    "id": "2025-10-10",
    "dateLabel": "Oct 10, 2025",
    "weekday": "Friday",
    "descriptor": "Top Stories",
    "topHeadline": "White House Signals Federal Layoffs Have Begun Amid Government Shutdown",
    "snippet": "The head of the White House budget office said on Friday that reductions in force had started.",
    "lead": "The head of the White House budget office said on Friday that reductions in force had started.",
    "events": [
      {
        "title": "White House Signals Federal Layoffs Have Begun Amid Government Shutdown",
        "summary": "The head of the White House budget office said on Friday that reductions in force had started.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/10/us/politics/federal-layoffs-government-shutdown.html"
      },
      {
        "title": "Judge Signals She Is Likely to Order Abrego Garcia’s Release Soon",
        "summary": "The judge expressed frequent frustrations with the Trump administration, saying it had presented a “totally inconsistent” case to keep the Maryland man in immigration detention.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/10/us/politics/abrego-garcia-hearing.html"
      },
      {
        "title": "The Trump Split Screen: A Peacemaker Abroad, a Retribution Campaign at Home",
        "summary": "President Trump’s dueling personas were on display this week, providing endless ammunition to his allies and his enemies alike.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/10/us/politics/trump-peace-retribution.html"
      }
    ]
  },
  {
    "id": "2025-10-11",
    "dateLabel": "Oct 11, 2025",
    "weekday": "Saturday",
    "descriptor": "Top Stories",
    "topHeadline": "In L.A., a Former Ally of Mayor Bass Is Expected to Run Against Her",
    "snippet": "The former supporter, Austin Beutner, who once led the city’s public schools as superintendent, is expected to challenge Ms. Bass’s re-election bid in next yea…",
    "lead": "The former supporter, Austin Beutner, who once led the city’s public schools as superintendent, is expected to challenge Ms. Bass’s re-election bid in next year’s mayoral race.",
    "events": [
      {
        "title": "In L.A., a Former Ally of Mayor Bass Is Expected to Run Against Her",
        "summary": "The former supporter, Austin Beutner, who once led the city’s public schools as superintendent, is expected to challenge Ms. Bass’s re-election bid in next year’s mayoral race.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/11/us/mayor-bass-austin-beutner.html"
      },
      {
        "title": "Trump Administration Is Bringing Back Scores of C.D.C. Experts Fired in Error",
        "summary": "Friday’s layoffs swept up scientists involved in responding to disease outbreaks and running an influential journal. Officials said the mistaken dismissals were being rescinded.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/11/health/cdc-layoffs-measles.html"
      },
      {
        "title": "Luigi Mangione’s lawyers push to dismiss death penalty charge",
        "summary": "Luigi Mangione’s legal team asked a New York federal judge Saturday to dismiss some criminal charges, including the only count for which he could face the death penalty, from a federal indictment bro…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/video/luigi-mangione-s-lawyers-push-to-dismiss-death-penalty-charge-249711173717"
      }
    ]
  },
  {
    "id": "2025-10-12",
    "dateLabel": "Oct 12, 2025",
    "weekday": "Sunday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump Heads to Israel and Then Egypt as Hostage-Prisoner Swap Nears",
    "snippet": "In Israel, he plans to meet with hostage families and address the Knesset, and in Egypt, he will help lead a summit with more than 20 countries to discuss the…",
    "lead": "In Israel, he plans to meet with hostage families and address the Knesset, and in Egypt, he will help lead a summit with more than 20 countries to discuss the peace process in Gaza.",
    "events": [
      {
        "title": "Trump Heads to Israel and Then Egypt as Hostage-Prisoner Swap Nears",
        "summary": "In Israel, he plans to meet with hostage families and address the Knesset, and in Egypt, he will help lead a summit with more than 20 countries to discuss the peace process in Gaza.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/12/us/politics/trump-leaves-for-a-visit-to-israel-and-will-later-co-chair-a-meeting-in-egypt-on-the-gaza-peace-plan.html"
      },
      {
        "title": "Who Are the Louisiana Voters Behind a Major Supreme Court Challenge?",
        "summary": "There is little information in court filings about the dozen plaintiffs who challenged the state’s voting map as an illegal racial gerrymander.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/12/us/politics/supreme-court-voting-rights.html"
      },
      {
        "title": "Why Now? The Lost Chances to Reach a Hostage Deal, and a Cease-Fire, Months Ago",
        "summary": "On Gaza, President Trump put few, if any, guardrails on Israel’s offensive, bucking international demands for a cease-fire. Then he changed course.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/12/us/politics/lost-chances-hostage-deal-gaza-israel.html"
      }
    ]
  },
  {
    "id": "2025-10-13",
    "dateLabel": "Oct 13, 2025",
    "weekday": "Monday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump’s Two Minds on China Sow a Chaotic Few Days",
    "snippet": "The president’s bellicose vow of steep new tariffs, followed quickly by a more conciliatory message, pointed to an internal tug of war over his approach.",
    "lead": "The president’s bellicose vow of steep new tariffs, followed quickly by a more conciliatory message, pointed to an internal tug of war over his approach.",
    "events": [
      {
        "title": "Trump’s Two Minds on China Sow a Chaotic Few Days",
        "summary": "The president’s bellicose vow of steep new tariffs, followed quickly by a more conciliatory message, pointed to an internal tug of war over his approach.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/13/us/politics/trump-china-tariffs.html"
      },
      {
        "title": "Trump Takes a Victory Lap, but Avoids Questions About What’s Next",
        "summary": "Except for brief references, President Trump did not talk about what it would take to rebuild Gaza or the future of the Palestinian people.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/13/world/middleeast/trump-victory-lap-whats-next.html"
      },
      {
        "title": "Kristi Noem says Coast Guard members will get paid during the government shutdown",
        "summary": "The Department of Homeland Security found an \"innovative solution\" to ensure Coast Guard personnel get paid. Most federal workers aren't receiving paychecks.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/trump-administration/kristi-noem-coast-guard-members-will-get-paid-government-shutdown-rcna237439"
      }
    ]
  },
  {
    "id": "2025-10-14",
    "dateLabel": "Oct 14, 2025",
    "weekday": "Tuesday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump Renews Threat to Cut ‘Democrat Programs’ as Government Shutdown Enters Third Week",
    "snippet": "The president said his administration was “closing up Democrat programs that we disagree with, and they’re never going to open again.” He promised to release a…",
    "lead": "The president said his administration was “closing up Democrat programs that we disagree with, and they’re never going to open again.” He promised to release a list of programs by Friday.",
    "events": [
      {
        "title": "Trump Renews Threat to Cut ‘Democrat Programs’ as Government Shutdown Enters Third Week",
        "summary": "The president said his administration was “closing up Democrat programs that we disagree with, and they’re never going to open again.” He promised to release a list of programs by Friday.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/14/us/politics/trump-threats-democrats-shutdown.html"
      },
      {
        "title": "Jack Smith speaks out against the Trump administration in rare interview",
        "summary": "Jack Smith, the special counsel who brought two criminal cases against Donald Trump, spoke out against the Trump administration in a rare interview posted Tuesday",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/justice-department/jack-smith-speaks-trump-administration-rare-interview-rcna237688"
      },
      {
        "title": "Jack Smith Calls Idea That Politics Infected Trump Prosecutions ‘Ludicrous’",
        "summary": "The former special counsel’s first extended remarks since resigning in January were released the same day House Republicans summoned him to testify.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/14/us/politics/jack-smith-house-judiciary-committee.html"
      }
    ]
  },
  {
    "id": "2025-10-15",
    "dateLabel": "Oct 15, 2025",
    "weekday": "Wednesday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump Administration Authorizes Covert C.I.A. Action in Venezuela",
    "snippet": "The development comes as the U.S. military is drawing up options for President Trump to consider, including possible strikes inside the country.",
    "lead": "The development comes as the U.S. military is drawing up options for President Trump to consider, including possible strikes inside the country.",
    "events": [
      {
        "title": "Trump Administration Authorizes Covert C.I.A. Action in Venezuela",
        "summary": "The development comes as the U.S. military is drawing up options for President Trump to consider, including possible strikes inside the country.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/15/us/politics/trump-covert-cia-action-venezuela.html"
      },
      {
        "title": "On Fox News, Mamdani Speaks Directly to Trump: I Won’t Be a Mayor Like Adams",
        "summary": "Zohran Mamdani, the Democratic nominee for New York City mayor, defended his positions while parrying questions about the Israel-Gaza war.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/15/nyregion/mamdani-fox-interview.html"
      },
      {
        "title": "The Lonely House Republican Still Coming to Work During the Shutdown",
        "summary": "Representative Kevin Kiley of California has criticized his own party for keeping the House out of session during the shutdown. He is battling boredom and disaffection as the stalemate drags on.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/15/us/politics/kevin-kiley-shutdown.html"
      }
    ]
  },
  {
    "id": "2025-10-16",
    "dateLabel": "Oct 16, 2025",
    "weekday": "Thursday",
    "descriptor": "Top Stories",
    "topHeadline": "John Bolton Indicted Over Handling of Classified Information",
    "snippet": "Mr. Bolton, a Trump aide turned critic, is part of a string of presidential foes to become prosecutorial targets. But his case gained momentum in the Biden adm…",
    "lead": "Mr. Bolton, a Trump aide turned critic, is part of a string of presidential foes to become prosecutorial targets. But his case gained momentum in the Biden administration.",
    "events": [
      {
        "title": "John Bolton Indicted Over Handling of Classified Information",
        "summary": "Mr. Bolton, a Trump aide turned critic, is part of a string of presidential foes to become prosecutorial targets. But his case gained momentum in the Biden administration.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/16/us/politics/john-bolton-indictment-trump.html"
      },
      {
        "title": "Solution to CIA’s Kryptos Sculpture Is Found in Smithsonian Vault",
        "summary": "Jim Sanborn is auctioning off the solution to Kryptos, the puzzle he sculpted for the intelligence agency’s headquarters. Two fans of the work then discovered the key.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/16/science/kryptos-cia-solution-sanborn-auction.html"
      },
      {
        "title": "New York mayoral candidates face off in heated debate",
        "summary": "Three candidates took the stage in the New York City mayoral race in the first of two debates. Zohran Mamdani, Andrew Cuomo and Curtis Sliwa faced off on issues from the economy, the National Guard i…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/video/new-york-mayoral-candidates-face-off-in-heated-debate-250057285982"
      }
    ]
  },
  {
    "id": "2025-10-17",
    "dateLabel": "Oct 17, 2025",
    "weekday": "Friday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump Says He Is Commuting George Santos’s Prison Sentence for Fraud",
    "snippet": "George Santos, the disgraced Republican congressman, had been sentenced to prison after his web of deceit unraveled. His lawyer said Mr. Santos expected to be…",
    "lead": "George Santos, the disgraced Republican congressman, had been sentenced to prison after his web of deceit unraveled. His lawyer said Mr. Santos expected to be released Friday.",
    "events": [
      {
        "title": "Trump Says He Is Commuting George Santos’s Prison Sentence for Fraud",
        "summary": "George Santos, the disgraced Republican congressman, had been sentenced to prison after his web of deceit unraveled. His lawyer said Mr. Santos expected to be released Friday.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/17/us/politics/trump-george-santos-sentence-commute.html"
      },
      {
        "title": "U.S. Detains 2 Survivors of Latest Military Strike in Caribbean",
        "summary": "The capture of prisoners presents a major new set of legal and policy problems for the Trump administration in its escalating campaign.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/17/us/politics/us-military-strike-survivors.html"
      },
      {
        "title": "Judge to Broaden Order Blocking Many Layoffs as Trump Seeks More Cuts",
        "summary": "Officials at some agencies had left open the possibility of layoffs in court filings, but a federal judge said she would widen an initial ban on the cuts.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/17/us/politics/trump-shutdown-cuts-unions.html"
      }
    ]
  },
  {
    "id": "2025-10-18",
    "dateLabel": "Oct 18, 2025",
    "weekday": "Saturday",
    "descriptor": "Top Stories",
    "topHeadline": "No Kings protests erupt nationwide, drawing nearly 7 million demonstrators",
    "snippet": "See 'No Kings' protest photos as demonstrations against the Trump administration return across the U.S., including in Los Angeles, Chicago and Portland.",
    "lead": "See 'No Kings' protest photos as demonstrations against the Trump administration return across the U.S., including in Los Angeles, Chicago and Portland.",
    "events": [
      {
        "title": "No Kings protests erupt nationwide, drawing nearly 7 million demonstrators",
        "summary": "See 'No Kings' protest photos as demonstrations against the Trump administration return across the U.S., including in Los Angeles, Chicago and Portland.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/news/us-news/no-kings-protest-photos-cities-demonstrations-rcna238041"
      },
      {
        "title": "Scenes from the ‘No Kings’ Anti-Trump Protests in Video and Photos",
        "summary": "With signs and chants, protesters take part in ‘No Kings’ rallies focused on what they see as overreach by the Trump administration.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/18/us/politics/no-kings-protests-trump.html"
      },
      {
        "title": "Venezuelan opposition leader María Corina Machado speaks out against Maduro regime",
        "summary": "In a new interview with NBC Nightly News Saturday anchor José Díaz-Balart, Venezuelan opposition leader María Corina Machado criticized leader Nicolas Maduro’s regime and praised President Trump as t…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/video/venezuelan-opposition-leader-maria-corina-machado-speaks-out-against-maduro-regime-250169925722"
      }
    ]
  },
  {
    "id": "2025-10-19",
    "dateLabel": "Oct 19, 2025",
    "weekday": "Sunday",
    "descriptor": "Top Stories",
    "topHeadline": "Colombia’s Leader Accuses U.S. of Murder, Prompting Trump to Halt Aid",
    "snippet": "President Gustavo Petro said a U.S. strike in the Caribbean had killed a fisherman. President Trump said he would cut aid and impose new tariffs on Colombian i…",
    "lead": "President Gustavo Petro said a U.S. strike in the Caribbean had killed a fisherman. President Trump said he would cut aid and impose new tariffs on Colombian imports.",
    "events": [
      {
        "title": "Colombia’s Leader Accuses U.S. of Murder, Prompting Trump to Halt Aid",
        "summary": "President Gustavo Petro said a U.S. strike in the Caribbean had killed a fisherman. President Trump said he would cut aid and impose new tariffs on Colombian imports.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/19/world/americas/trump-colombia-petro-aid.html"
      },
      {
        "title": "Shell Detonated Over Interstate 5 During Marines Event, California Officials Say",
        "summary": "The mishap, during an anniversary celebration for the Marine Corps attended by the vice president and defense secretary, underscores safety concerns that Gov. Gavin Newsom voiced before Saturday’s ev…",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/19/us/politics/shell-interstate-5-marines-california.html"
      },
      {
        "title": "New allegations from Epstein accuser Virginia Roberts Giuffre’s new memoir",
        "summary": "Virginia Roberts Giuffre, one of the most prominent Jeffrey Epstein accusers, is revealing new allegations about the abuse she endured in a new memoir set to be released this week, after her death in…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/video/new-allegations-from-epstein-accuser-virginia-roberts-giuffre-s-new-memoir-250197573920"
      }
    ]
  },
  {
    "id": "2025-10-20",
    "dateLabel": "Oct 20, 2025",
    "weekday": "Monday",
    "descriptor": "Top Stories",
    "topHeadline": "White House’s East Wing Partially Demolished to Build Trump’s Ballroom",
    "snippet": "The president had pledged that construction wouldn’t “interfere with the current building,” a promise that always seemed unrealistic given the grand scale of t…",
    "lead": "The president had pledged that construction wouldn’t “interfere with the current building,” a promise that always seemed unrealistic given the grand scale of the plans.",
    "events": [
      {
        "title": "White House’s East Wing Partially Demolished to Build Trump’s Ballroom",
        "summary": "The president had pledged that construction wouldn’t “interfere with the current building,” a promise that always seemed unrealistic given the grand scale of the plans.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/20/us/politics/trump-white-house-east-wing-demolition-ballroom.html"
      },
      {
        "title": "Some States With Democratic Governors Are Posting Partisan Shutdown Messages on Official Websites",
        "summary": "The messages follow a pattern set by the Trump administration, but use notably milder language.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/20/us/politics/shutdown-messages-state-websites.html"
      },
      {
        "title": "Trump Hopes Argentina Can Help Bring Down Beef Prices",
        "summary": "President Trump’s plan to import red meat runs counter to his philosophy of increasing domestic production, and has angered cattle ranchers in the United States.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/20/us/politics/trump-argentina-beef.html"
      }
    ]
  },
  {
    "id": "2025-10-21",
    "dateLabel": "Oct 21, 2025",
    "weekday": "Tuesday",
    "descriptor": "Top Stories",
    "topHeadline": "As Trump Moves Forward With White House Ballroom Project, Architects Raise Concerns",
    "snippet": "Architects were surprised by the scale and speed of the project, but the president is moving forward with his plans for a ballroom at the White House.",
    "lead": "Architects were surprised by the scale and speed of the project, but the president is moving forward with his plans for a ballroom at the White House.",
    "events": [
      {
        "title": "As Trump Moves Forward With White House Ballroom Project, Architects Raise Concerns",
        "summary": "Architects were surprised by the scale and speed of the project, but the president is moving forward with his plans for a ballroom at the White House.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/21/arts/design/trump-ballroom-architects-review.html"
      },
      {
        "title": "Hegseth cracks down on Pentagon staff speaking to Congress",
        "summary": "The Defense Department is significantly changing its policy of interacting with Congress, according to a new, five-page memo obtained by NBC News",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/national-security/pentagon-memo-instructs-staff-get-permission-speak-congress-rcna239037"
      },
      {
        "title": "Ecuador Rejects Prosecution of Survivor of U.S. Strike on Vessel",
        "summary": "The country has freed the man, one of two survivors of a U.S. military strike on a submersible vessel last week, defying President Trump’s claim that he would be held and prosecuted.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/21/us/politics/ecuador-us-strike-survivor.html"
      }
    ]
  },
  {
    "id": "2025-10-22",
    "dateLabel": "Oct 22, 2025",
    "weekday": "Wednesday",
    "descriptor": "Top Stories",
    "topHeadline": "U.S. Strikes Boats in Pacific, Expanding Operation Against Drug-Running Suspects",
    "snippet": "The Trump administration announced a second strike outside the Caribbean, in a campaign against what U.S. officials say are boats carrying drugs bound for the…",
    "lead": "The Trump administration announced a second strike outside the Caribbean, in a campaign against what U.S. officials say are boats carrying drugs bound for the United States.",
    "events": [
      {
        "title": "U.S. Strikes Boats in Pacific, Expanding Operation Against Drug-Running Suspects",
        "summary": "The Trump administration announced a second strike outside the Caribbean, in a campaign against what U.S. officials say are boats carrying drugs bound for the United States.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/22/us/politics/trump-drug-boat-strike-colombia.html"
      },
      {
        "title": "University of Virginia Makes Deal With White House to Halt Investigations",
        "summary": "The Justice Department had been scrutinizing one of the nation’s premier public universities over accusations of civil rights violations.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/22/us/politics/university-of-virginia-trump-agreement.html"
      },
      {
        "title": "As Johnson Delays, Grijalva Sues to Be Sworn In to Congress",
        "summary": "Representative-elect Adelita Grijalva, Democrat of Arizona, along with the state’s attorney general, argued that the speaker had no authority to delay swearing her into office.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/22/us/politics/adelita-grijalva-lawsuit-swearing-in-congress.html"
      }
    ]
  },
  {
    "id": "2025-10-23",
    "dateLabel": "Oct 23, 2025",
    "weekday": "Thursday",
    "descriptor": "Top Stories",
    "topHeadline": "Democrats Block Federal Worker Pay Bill as Shutdown Drags On",
    "snippet": "A Republican measure that would pay essential government employees faltered in the Senate, and the G.O.P. blocked a pair of Democratic bills to pay a broader s…",
    "lead": "A Republican measure that would pay essential government employees faltered in the Senate, and the G.O.P. blocked a pair of Democratic bills to pay a broader swath of workers.",
    "events": [
      {
        "title": "Democrats Block Federal Worker Pay Bill as Shutdown Drags On",
        "summary": "A Republican measure that would pay essential government employees faltered in the Senate, and the G.O.P. blocked a pair of Democratic bills to pay a broader swath of workers.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/23/us/politics/democrats-shutdown-federal-employee-pay.html"
      },
      {
        "title": "Protester Who Played ‘Star Wars’ Song Sues After Arrest in Washington",
        "summary": "Sam O’Hara was playing the “Imperial March” theme from the movie while protesting the deployment of National Guard troops in the capital when he was handcuffed by city police officers.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/23/us/politics/protester-who-played-star-wars-song-sues-after-arrest-in-washington.html"
      },
      {
        "title": "Musk Attacks NASA Leader Over Threat to Reconsider Lunar Contract",
        "summary": "The billionaire’s swipes at Sean Duffy are the latest example of his tangling with members of the Trump administration.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/23/us/politics/elon-musk-duffy-nasa.html"
      }
    ]
  },
  {
    "id": "2025-10-24",
    "dateLabel": "Oct 24, 2025",
    "weekday": "Friday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump Administration Plans a Shake-Up at ICE to Speed Deportations",
    "snippet": "The preliminary plan stems from frustration over the pace of the deportations, which are lagging behind President Trump’s demands.",
    "lead": "The preliminary plan stems from frustration over the pace of the deportations, which are lagging behind President Trump’s demands.",
    "events": [
      {
        "title": "Trump Administration Plans a Shake-Up at ICE to Speed Deportations",
        "summary": "The preliminary plan stems from frustration over the pace of the deportations, which are lagging behind President Trump’s demands.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/24/us/politics/trump-deportations-ice.html"
      },
      {
        "title": "Bannon Claims ‘There Is a Plan’ for Trump to Run for a Third Term",
        "summary": "The claim comes after months of President Trump toying with the idea, insisting that he is “not joking” about defying a constitutionally-mandated term limit.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/24/us/politics/president-trump-2028-steve-bannon.html"
      },
      {
        "title": "Federal workers flock to D.C. food bank as they miss first full paycheck of shutdown",
        "summary": "Federal workers lined up outside of the Capital Area Food Bank after missing their first full paycheck since the now 24-day government shutdown began.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/politics-news/federal-workers-dc-food-bank-miss-first-full-paycheck-shutdown-rcna239698"
      }
    ]
  },
  {
    "id": "2025-10-25",
    "dateLabel": "Oct 25, 2025",
    "weekday": "Saturday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump Announces Tariff Increase on Canada Over Reagan Ad Spat",
    "snippet": "The ad, which will stop airing on Monday, used audio of a 1987 address by Ronald Reagan making a case against tariffs.",
    "lead": "The ad, which will stop airing on Monday, used audio of a 1987 address by Ronald Reagan making a case against tariffs.",
    "events": [
      {
        "title": "Trump Announces Tariff Increase on Canada Over Reagan Ad Spat",
        "summary": "The ad, which will stop airing on Monday, used audio of a 1987 address by Ronald Reagan making a case against tariffs.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/25/world/canada/trump-tariffs-reagan-ad.html"
      },
      {
        "title": "Navy Begins Evacuating Families From Guantánamo Bay Ahead of Hurricane Melissa",
        "summary": "The base commander on Saturday expanded a previous evacuation order to include “non-mission-essential U.S. citizens.”",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/25/us/politics/guantanamo-bay-hurricane-melissa-evacuations.html"
      },
      {
        "title": "Trump raises Canada tariffs amid high-stakes Asia trip",
        "summary": "On Air Force One heading to his high-stakes trip to Asia, President Trump said he’s raising tariffs on Canada by 10 percent in reaction to a TV ad that criticized his tariff policies. NBC News’ Gabe…",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/video/trump-raises-canada-tariffs-amid-high-stakes-asia-trip-250636357587"
      }
    ]
  },
  {
    "id": "2025-10-26",
    "dateLabel": "Oct 26, 2025",
    "weekday": "Sunday",
    "descriptor": "Top Stories",
    "topHeadline": "Mamdani and the Left’s Biggest Stars Unite Before a Sea of Supporters",
    "snippet": "As Senator Bernie Sanders and Representative Alexandria Ocasio-Cortez joined Zohran Mamdani on Sunday at Forest Hills Stadium, a bigger test for the left may s…",
    "lead": "As Senator Bernie Sanders and Representative Alexandria Ocasio-Cortez joined Zohran Mamdani on Sunday at Forest Hills Stadium, a bigger test for the left may still lie ahead.",
    "events": [
      {
        "title": "Mamdani and the Left’s Biggest Stars Unite Before a Sea of Supporters",
        "summary": "As Senator Bernie Sanders and Representative Alexandria Ocasio-Cortez joined Zohran Mamdani on Sunday at Forest Hills Stadium, a bigger test for the left may still lie ahead.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/26/nyregion/mamdani-sanders-aoc-rally.html"
      },
      {
        "title": "Zohran Mamdani, Bernie Sanders and Alexandria Ocasio-Cortez slam Trump at raucous rally",
        "summary": "New York mayoral hopeful Zohran Mamdani and two of his most prominent backers, Sen.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/elections/zohran-mamdani-bernie-sanders-alexandria-ocasio-cortez-slam-trump-rauc-rcna239944"
      },
      {
        "title": "Keeping the House Absent, Johnson Marginalizes Congress and Himself",
        "summary": "The speaker’s decision to hold the House in an indefinite hiatus during the shutdown is his latest move to diminish the role of the legislative branch — and his own post.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/25/us/politics/mike-johnson-speaker-congress.html"
      }
    ]
  },
  {
    "id": "2025-10-27",
    "dateLabel": "Oct 27, 2025",
    "weekday": "Monday",
    "descriptor": "Top Stories",
    "topHeadline": "Government Shutdown Imperils SNAP and Other Antipoverty Programs",
    "snippet": "Within days, tens of millions of low-income Americans may lose assistance for food, child care and utilities if the federal government remains shut down.",
    "lead": "Within days, tens of millions of low-income Americans may lose assistance for food, child care and utilities if the federal government remains shut down.",
    "events": [
      {
        "title": "Government Shutdown Imperils SNAP and Other Antipoverty Programs",
        "summary": "Within days, tens of millions of low-income Americans may lose assistance for food, child care and utilities if the federal government remains shut down.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/27/us/politics/trump-shutdown-snap-food-stamps-aid.html"
      },
      {
        "title": "California says it will monitor the Justice Department's election watchers next week",
        "summary": "State Attorney General Rob Bonta announced California will deploy its own election observers after U.S. Attorney General Pam Bondi said DOJ would monitor polls in five counties.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/elections/california-monitor-justice-department-election-watchers-rob-bonta-rcna240148"
      },
      {
        "title": "AFGE, Top Federal Workers’ Union, Sides With Republicans on Shutdown",
        "summary": "The American Federation of Government Employees, in a shift, called on Congress to immediately reopen the government without the health care measures sought by Democratic lawmakers.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/27/us/politics/afge-federal-workers-union-government-shutdown.html"
      }
    ]
  },
  {
    "id": "2025-10-28",
    "dateLabel": "Oct 28, 2025",
    "weekday": "Tuesday",
    "descriptor": "Top Stories",
    "topHeadline": "Federal Judge Disqualifies Trump-Backed Prosecutor in Los Angeles",
    "snippet": "The court ruled that Bill Essayli had been acting “unlawfully” as U.S. attorney in Los Angeles but that he could stay on as the office’s top deputy for now.",
    "lead": "The court ruled that Bill Essayli had been acting “unlawfully” as U.S. attorney in Los Angeles but that he could stay on as the office’s top deputy for now.",
    "events": [
      {
        "title": "Federal Judge Disqualifies Trump-Backed Prosecutor in Los Angeles",
        "summary": "The court ruled that Bill Essayli had been acting “unlawfully” as U.S. attorney in Los Angeles but that he could stay on as the office’s top deputy for now.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/28/us/us-attorney-bill-essayli-los-angeles-ruling.html"
      },
      {
        "title": "Appeals Court to Reconsider Oregon National Guard Deployment Trump Wants",
        "summary": "Judges in the Ninth Circuit voted to have a larger panel reconsider a decision that could have allowed President Trump to use soldiers at the Portland, Ore., immigration building.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/28/us/politics/trump-national-guard-oregon-court.html"
      },
      {
        "title": "Trump Officials in Charge of Food Stamps Leave Their Posts",
        "summary": "The departures of the head of the Agriculture Department’s Food and Nutrition Service and a senior policy adviser spurred worries on Capitol Hill as food aid benefits could halt.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/28/us/politics/trump-usda-food-nutrition.html"
      }
    ]
  },
  {
    "id": "2025-10-29",
    "dateLabel": "Oct 29, 2025",
    "weekday": "Wednesday",
    "descriptor": "Top Stories",
    "topHeadline": "Trump Threatens to Resume Nuclear Weapons Testing, Minutes Before Xi Meeting",
    "snippet": "Just minutes before he was scheduled to meet President Xi Jinping of China, the president threatened on social media to resume nuclear testing for the first ti…",
    "lead": "Just minutes before he was scheduled to meet President Xi Jinping of China, the president threatened on social media to resume nuclear testing for the first time in 33 years.",
    "events": [
      {
        "title": "Trump Threatens to Resume Nuclear Weapons Testing, Minutes Before Xi Meeting",
        "summary": "Just minutes before he was scheduled to meet President Xi Jinping of China, the president threatened on social media to resume nuclear testing for the first time in 33 years.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/29/us/politics/trump-nuclear-weapons-testing.html"
      },
      {
        "title": "Trump orders Pentagon to begin testing nuclear weapons 'immediately'",
        "summary": "The U.S. voluntarily halted nuclear explosive testing in 1992, though it has the ability to resume tests at a site in Nevada.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/politics/national-security/trump-orders-pentagon-begin-testing-nuclear-weapons-immediately-rcna240681"
      },
      {
        "title": "Toyota Says $10 Billion U.S. Investment Touted by Trump Isn’t New",
        "summary": "Japanese officials have called into question some elements of the flurry of big new investments announced by President Trump during his Japan visit.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/29/business/trump-toyota-10-billion.html"
      }
    ]
  },
  {
    "id": "2025-11-01",
    "dateLabel": "Nov 1, 2025",
    "weekday": "Saturday",
    "descriptor": "Top Stories",
    "topHeadline": "War Powers Law Does Not Apply to Trump’s Boat Strikes, Administration Says",
    "snippet": "The move deepened the idea that a Vietnam-era law, which says congressionally unauthorized deployments into “hostilities” must end after 60 days, does not appl…",
    "lead": "The move deepened the idea that a Vietnam-era law, which says congressionally unauthorized deployments into “hostilities” must end after 60 days, does not apply to airstrike campaigns.",
    "events": [
      {
        "title": "War Powers Law Does Not Apply to Trump’s Boat Strikes, Administration Says",
        "summary": "The move deepened the idea that a Vietnam-era law, which says congressionally unauthorized deployments into “hostilities” must end after 60 days, does not apply to airstrike campaigns.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/11/01/us/politics/trump-boat-attacks-war-powers.html"
      },
      {
        "title": "Tracking the Early Vote in New York, New Jersey and Virginia",
        "summary": "See the age breakdown in New York City and the partisanship in New Jersey and Virginia of the voters who have cast ballots so far.",
        "source": "New York Times",
        "url": "https://www.nytimes.com/2025/10/31/upshot/early-voters-2025-election.html"
      },
      {
        "title": "Masih Alinejad says 'justice is beautiful' after sentencing of men who tried to kill her",
        "summary": "Iranian activist Masih Alinejad joins Meet the Press NOW after a federal judge sentences two men hired by the Iranian regime to 25 years in prison for plotting to assassinate her in 2022.",
        "source": "NBC News",
        "url": "https://www.nbcnews.com/meet-the-press/video/masih-alinejad-says-justice-is-beautiful-after-sentencing-of-men-who-tried-to-kill-her-251131461717"
      }
    ]
  }
]
